src/main/java/ru/vk/itmo/test/proninvalentin/reports/stage1/wrk/put/put_45000rps.txt
lua_scripts % wrk -d 2m -t 1 -c 1 -R 45000 -s put.lua -L  http://localhost:8080/v0/entry
Running 2m test @ http://localhost:8080/v0/entry
  1 threads and 1 connections
  Thread calibration: mean lat.: 27.143ms, rate sampling interval: 192ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.80ms    8.13ms  72.32ms   93.27%
    Req/Sec    45.12k     1.42k   49.12k    86.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  702.00us
 75.000%    1.03ms
 90.000%    5.60ms
 99.000%   48.35ms
 99.900%   68.22ms
 99.990%   71.94ms
 99.999%   72.32ms
100.000%   72.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.014     0.000000            4         1.00
       0.164     0.100000       495119         1.11
       0.300     0.200000       991243         1.25
       0.436     0.300000      1488065         1.43
       0.569     0.400000      1982991         1.67
       0.702     0.500000      2476863         2.00
       0.768     0.550000      2722987         2.22
       0.836     0.600000      2971619         2.50
       0.903     0.650000      3220156         2.86
       0.969     0.700000      3466292         3.33
       1.035     0.750000      3714455         4.00
       1.068     0.775000      3838441         4.44
       1.101     0.800000      3963568         5.00
       1.133     0.825000      4083783         5.71
       1.185     0.850000      4207744         6.67
       2.681     0.875000      4331156         8.00
       3.785     0.887500      4392919         8.89
       5.603     0.900000      4454845        10.00
       7.723     0.912500      4516713        11.43
       9.735     0.925000      4578754        13.33
      11.783     0.937500      4640621        16.00
      13.079     0.943750      4671336        17.78
      14.679     0.950000      4702378        20.00
      16.047     0.956250      4733211        22.86
      18.895     0.962500      4764162        26.67
      23.615     0.968750      4795071        32.00
      25.871     0.971875      4810548        35.56
      29.087     0.975000      4826111        40.00
      32.399     0.978125      4841510        45.71
      34.943     0.981250      4857122        53.33
      40.415     0.984375      4872474        64.00
      42.943     0.985938      4880222        71.11
      45.375     0.987500      4887924        80.00
      47.391     0.989062      4895617        91.43
      49.567     0.990625      4903397       106.67
      52.575     0.992188      4911110       128.00
      54.111     0.992969      4914951       142.22
      55.807     0.993750      4918872       160.00
      57.791     0.994531      4922685       182.86
      59.615     0.995313      4926562       213.33
      61.471     0.996094      4930495       256.00
      62.303     0.996484      4932384       284.44
      62.975     0.996875      4934363       320.00
      63.743     0.997266      4936321       365.71
      64.607     0.997656      4938195       426.67
      65.727     0.998047      4940105       512.00
      66.303     0.998242      4941051       568.89
      66.879     0.998437      4942100       640.00
      67.327     0.998633      4943070       731.43
      67.839     0.998828      4943996       853.33
      68.223     0.999023      4944939      1024.00
      68.351     0.999121      4945507      1137.78
      68.543     0.999219      4945947      1280.00
      68.927     0.999316      4946405      1462.86
      69.375     0.999414      4946888      1706.67
      69.887     0.999512      4947377      2048.00
      70.527     0.999561      4947578      2275.56
      70.783     0.999609      4947817      2560.00
      71.039     0.999658      4948067      2925.71
      71.295     0.999707      4948302      3413.33
      71.551     0.999756      4948599      4096.00
      71.615     0.999780      4948721      4551.11
      71.679     0.999805      4948834      5120.00
      71.743     0.999829      4948927      5851.43
      71.871     0.999854      4949130      6826.67
      71.935     0.999878      4949287      8192.00
      71.935     0.999890      4949287      9102.22
      71.935     0.999902      4949287     10240.00
      71.999     0.999915      4949387     11702.86
      72.063     0.999927      4949478     13653.33
      72.063     0.999939      4949478     16384.00
      72.127     0.999945      4949527     18204.44
      72.127     0.999951      4949527     20480.00
      72.191     0.999957      4949608     23405.71
      72.191     0.999963      4949608     27306.67
      72.191     0.999969      4949608     32768.00
      72.255     0.999973      4949672     36408.89
      72.255     0.999976      4949672     40960.00
      72.255     0.999979      4949672     46811.43
      72.255     0.999982      4949672     54613.33
      72.319     0.999985      4949724     65536.00
      72.319     0.999986      4949724     72817.78
      72.319     0.999988      4949724     81920.00
      72.319     0.999989      4949724     93622.86
      72.319     0.999991      4949724    109226.67
      72.319     0.999992      4949724    131072.00
      72.319     0.999993      4949724    145635.56
      72.319     0.999994      4949724    163840.00
      72.319     0.999995      4949724    187245.71
      72.383     0.999995      4949750    218453.33
      72.383     1.000000      4949750          inf
#[Mean    =        2.801, StdDeviation   =        8.128]
#[Max     =       72.320, Total count    =      4949750]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5399941 requests in 2.00m, 345.04MB read
Requests/sec:  44999.55
Transfer/sec:      2.88MB